{
    "longTermProjects": [{
        "name": "Dichopter® Project",
        "date": "August 2018 - May 2019",
        "desc": "The Dichopter® Project aims to provide the user with hardware and software tools to help them explore dichoptic vision – that is, two eyed or binocular vision where two images are presented to the left and right eye separately. The Dichopter Project allows people to expolore 3D vision and perception of other physics simulations. I enjoyed this project because it required me to learn how to optimize web pages when dealing with lots of content. ",
        "technologiesUsed": ["JavaScript", "GitHub", "Progressive Web Apps", "Caching", "p5.js", "Materialize CSS"],
        "role": "Lead Developer",
        "url": "https://dichopter.com",
        "imageURL": "https://dichopter.com/viewer/viewer.jpg"
    }],
    "artAndDoodles": [{
        "name": "Moiré Effect",
        "date": "August 2018",
        "desc": "What you are seeing is actually just two sets of horizontal lines being rotated. The vertical lines that appear are an optical illusion, the Moiré effect.",
        "technologiesUsed" : ["JavaScript", "p5.js"],
        "url": "moire-squares",
        "imageURL": "display.gif"
    },
    {
        "name": "Binary Numbers",
        "date": "March 2019",
        "desc": "I got most of my code following a tutorial by Dan Shiffman. What this does is show a binary representation of a number through the dots at the top. The decimal representation is in the center. I modified it to respond to mouse events so users can shift the binary number left and right. You can also enter in a decimal number and it will automatically convert it to binary!",
        "technologiesUsed" : ["JavaScript", "p5.js"],
        "url": "binary-numbers",
        "imageURL": "capture.PNG"
    },
    {
        "name": "Pong",
        "date": "May 2019",
        "desc": "I remade Pong! This is two player, player one moves with WASD and player two moves with the arrow keys.",
        "technologiesUsed" : ["JavaScript", "p5.js"],
        "url": "binary-numbers",
        "imageURL": "capture.gif"
    }],
    "academicProjects" : [{
        "name": "Consent in Hookup Culture",
        "date": "May 2019",
        "desc": "For my final project in my writing class, I was required to write an essay about a philosophical issue I would like to explore. I chose to write about hookup culture and what consent really means. Oftentimes, I argue, consent is not respected in hookup culture. How should we respond to this?",
        "url": "consent"
    }]
}